Revit 2027 API
IFCProductWrapper.Create Method
Overload List
Name | Description
Create(IFCProductWrapper) |  Establishes a new product manager for elements and objects derived from a parent product manager.
Create(ExporterIFC, Boolean) |  Establishes a new baseline product manager for elements and objects.
Create(IFCProductWrapper, Boolean) |  Establishes a new product manager for elements and objects derived from a parent product manager, allowing override of allowRelateToLevel
Top
See Also
Reference
IFCProductWrapper Class
Autodesk.Revit.DB.IFC Namespace